print("-------------------12月份衣服销售数据------------------")
import xlrd

book = xlrd.open_workbook("12月份衣服销售数据.xlsx")
sheet = book.sheet_by_index(0)
for row_index in range(sheet.nrows):
    print(sheet.row_values(row_index))

Goods = [['1号', '羽绒服', 253.6, 500.0, 10.0],
         ['2号', '牛仔裤', 86.3, 600.0, 60.0],
         ['3号', '风衣', 96.8, 335.0, 43.0],
         ['4号', '皮草', 135.9, 855.0, 63.0],
         ['5号', 'T血', 65.8, 632.0, 63.0],
         ['6号', '衬衫', 49.3, 562.0, 120.0],
         ['7号', '牛仔裤', 86.3, 600.0, 72.0],
         ['8号', '羽绒服', 253.6, 500.0, 69.0],
         ['9号', '牛仔裤', 86.3, 600.0, 35.0],
         ['10号', '羽绒服', 253.6, 500.0, 140.0],
         ['11号', '牛仔裤', 86.3, 600.0, 90.0],
         ['12号', '皮草', 135.9, 855.0, 24.0],
         ['13号', 'T血', 65.8, 632.0, 45.0],
         ['14号', '风衣', 96.8, 335.0, 25.0],
         ['15号', '牛仔裤', 86.3, 600.0, 60.0],
         ['16号', 'T血', 65.8, 632.0, 129.0],
         ['17号', '羽绒服', 253.6, 500.0, 10.0],
         ['18号', '风衣', 96.8, 335.0, 43.0],
         ['19号', 'T血', 65.8, 632.0, 63.0],
         ['20号', '牛仔裤', 86.3, 600.0, 60.0],
         ['21号', '皮草', 135.9, 855.0, 63.0],
         ['22号', '风衣', 96.8, 335.0, 60.0],
         ['23号', 'T血', 65.8, 632.0, 58.0],
         ['24号', '牛仔裤', 86.3, 600.0, 140.0],
         ['25号', 'T血', 65.8, 632.0, 48.0],
         ['26号', '风衣', 96.8, 335.0, 43.0],
         ['27号', '皮草', 135.9, 855.0, 57.0],
         ['28号', '羽绒服', 253.6, 500.0, 10.0],
         ['29号', 'T血', 65.8, 632.0, 63.0],
         ['30号', '风衣', 96.8, 335.0, 78.0],
         ]
a = 0
b = 0
c = 0
d = 0
e=0
f=0
g=0
h=0
i=0
while a <= 29:
    b = b + Goods[a][2] * Goods[a][4]
    a += 1;
a = 0
while a <= 29:
    c = c + Goods[a][4]
    a += 1;

a = 0
while a <= 29:
    if Goods[a][1] == "羽绒服":
        d = d + Goods[a][4]
    elif Goods[a][1] == "牛仔裤":
        e=e+Goods[a][4]
    elif Goods[a][1] == "风衣":
        f=f+Goods[a][4]
    elif Goods[a][1] == "皮草":
        g=g+Goods[a][4]
    elif Goods[a][1] == "T血":
        h=h+Goods[a][4]
    elif Goods[a][1] == "衬衫":
        i=i+Goods[a][4]

    a += 1;



print("总销售额为:", b);
print("平均每日销售数量为:", c / 30);
print("羽绒服月销售量占比:", d / c);
print("牛仔裤月销售量占比:", e/ c);
print("风衣月销售量占比:", f / c);
print("皮草月销售量占比:", g / c);
print("T血月销售量占比:", h / c);
print("衬衫月销售量占比:", i / c);


print("", d,e,f,g,h,i)
